Find the average hours worked by:
- Each gender
- Each occupation category
- Marital Status
- Marital Status and Gende

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import os
os.chdir("F:\\Work\\Jigsaw Academy\\Corporate Trainings\\Maersk\\Day 1\\Caselets\\Data Manipulation")

In [3]:
dat=pd.read_csv('audit.csv')

In [4]:
dat.head(2)

,ID,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours,RISK_Adjustment,TARGET_Adjusted
0,1004641,38,Private,College,Unmarried,Service,81838,Female,0,72,0,0
1,1010229,35,Private,Associate,Absent,Transport,72099,Male,0,30,0,0

In [5]:
dat.groupby('Gender')[['Hours']].mean()

            Hours
Gender
Female  35.802215
Male    42.048246

In [6]:
dat.groupby('Occupation')[['Hours']].mean()

                  Hours
Occupation
Cleaner       37.736264
Clerical      37.405172
Executive     44.211073
Farming       45.241379
Home          30.000000
Machinist     40.884892
Military      40.000000
Professional  41.906883
Protective    40.775000
Repair        42.311111
Sales         40.145631
Service       35.095238
Support       38.571429
Transport     43.168224

In [7]:
dat.groupby('Marital')[['Hours']].mean()

                           Hours
Marital
Absent                 36.699552
Divorced               40.781955
Married                42.776445
Married-spouse-absent  41.227273
Unmarried              39.253731
Widowed                33.661017

In [9]:
dat.groupby(['Marital','Gender'])[['Hours']].mean()

                                  Hours
Marital               Gender
Absent                Female  34.406360
                      Male    38.380829
Divorced              Female  39.662420
                      Male    42.394495
Married               Female  34.500000
                      Male    43.721750
Married-spouse-absent Female  38.300000
                      Male    43.666667
Unmarried             Female  37.157895
                      Male    42.000000
Widowed               Female  32.500000
                      Male    40.111111

How many people had zero deductions? Out of these how many had income greater than 70,000?

In [10]:
dat.query('Deductions==0').shape[0]

1917

In [11]:
dat.query('Deductions==0 & Income>70000').shape[0]

844

Compute the %age of productive audits across
- Gender
- Marital Status
- Education level

In [28]:
dat.groupby('Gender')[['TARGET_Adjusted']].sum()[['TARGET_Adjusted']]/dat.groupby('Gender').count()[['TARGET_Adjusted']]

        TARGET_Adjusted
Gender
Female         0.107595
Male           0.288743

In [29]:
dat.groupby('Occupation')[['TARGET_Adjusted']].sum()[['TARGET_Adjusted']]/dat.groupby('Occupation').count()[['TARGET_Adjusted']]

              TARGET_Adjusted
Occupation
Cleaner              0.065934
Clerical             0.146552
Executive            0.467128
Farming              0.103448
Home                 0.000000
Machinist            0.129496
Military             0.000000
Professional         0.412955
Protective           0.375000
Repair               0.213333
Sales                0.228155
Service              0.033333
Support              0.285714
Transport            0.140187

In [30]:
dat.groupby('Marital')[['TARGET_Adjusted']].sum()[['TARGET_Adjusted']]/dat.groupby('Marital').count()[['TARGET_Adjusted']]

                       TARGET_Adjusted
Marital
Absent                        0.044843
Divorced                      0.075188
Married                       0.438386
Married-spouse-absent         0.090909
Unmarried                     0.074627
Widowed                       0.067797

In [31]:
dat.groupby(['Marital','Gender'])[['TARGET_Adjusted']].sum()[['TARGET_Adjusted']]/dat.groupby(['Marital','Gender']).count()[['TARGET_Adjusted']]

                              TARGET_Adjusted
Marital               Gender
Absent                Female         0.024735
                      Male           0.059585
Divorced              Female         0.044586
                      Male           0.119266
Married               Female         0.500000
                      Male           0.431349
Married-spouse-absent Female         0.100000
                      Male           0.083333
Unmarried             Female         0.078947
                      Male           0.068966
Widowed               Female         0.060000
                      Male           0.111111